OpenFOAM-6-master/tutorials/combustion/fireFoam/LES/oppositeBurningPanels/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    ground
    {
        type            fixedValue;
        value           $internalField;
    }

    burner
    {
        type            flowRateInletVelocity;
        massFlowRate    constant 0.001294;     //60kW  C3H8
        value           uniform (0 0 0);
    }

    "(top|sides)"
    {
        type            pressureInletOutletVelocity;
        value           $internalField;
    }

    "(region0_to.*)"
    {
        type            mappedFlowRate;
        nbrPhi          phiGas;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
