OpenFOAM-6-master/tutorials/combustion/fireFoam/LES/oppositeBurningPanels/constant/pyrolysisZones
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       dictionary;
    location    "constant";
    object      pyrolysisZones;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pyrolysis
{
    active          true;

    pyrolysisModel  reactingOneDim;

    regionName      panelRegion;

    reactingOneDimCoeffs
    {
        gasHSource      false; // Energy source term due to pyrolysis gas
        qrHSource       false; // Energy source term due in depht radiation
        minimumDelta    1e-12;

        reactionDeltaMin 1e-12;

        moveMesh        false;
    }

    infoOutput      true;
}


// ************************************************************************* //
